RT-Thread/rt-thread/bsp/stm32/libraries/STM32H7RSxx_HAL/STM32H7RSxx_HAL_Driver/Inc/stm32h7rsxx_ll_bus.h
/**
  ******************************************************************************
  * @file    stm32h7rsxx_ll_bus.h
  * @author  MCD Application Team
  * @brief   Header file of BUS LL module.
  *
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2022 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  @verbatim
                      ##### RCC Limitations #####
  ==============================================================================
    [..]
      A delay between an RCC peripheral clock enable and the effective peripheral
      enabling should be taken into account in order to manage the peripheral read/write
      from/to registers.
      (+) This delay depends on the peripheral mapping.
        (++) AHB & APB peripherals, 1 dummy read is necessary

    [..]
      Workarounds:
      (#) For AHB & APB peripherals, a dummy read to the peripheral register has been
          inserted in each LL_{BUS}_GRP{x}_EnableClock() function.

  @endverbatim
  */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef STM32H7RSxx_LL_BUS_H
#define STM32H7RSxx_LL_BUS_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32h7rsxx.h"

/** @addtogroup STM32H7RSxx_LL_Driver
  * @{
  */
#if defined(RCC)

/** @defgroup BUS_LL BUS
  * @{
  */

/* Private variables ---------------------------------------------------------*/

/* Private constants ---------------------------------------------------------*/

/* Private macros ------------------------------------------------------------*/

/* Exported types ------------------------------------------------------------*/

/* Exported constants --------------------------------------------------------*/
/** @defgroup BUS_LL_Exported_Constants BUS Exported Constants
  * @{
  */

/** @defgroup BUS_LL_EC_AHB1_GRP1_PERIPH  AHB1 GRP1 PERIPH
  * @{
  */
#define LL_AHB1_GRP1_PERIPH_GPDMA1         RCC_AHB1ENR_GPDMA1EN
#define LL_AHB1_GRP1_PERIPH_ADC12          RCC_AHB1ENR_ADC12EN
#define LL_AHB1_GRP1_PERIPH_ETH1MAC        RCC_AHB1ENR_ETH1MACEN
#define LL_AHB1_GRP1_PERIPH_ETH1TX         RCC_AHB1ENR_ETH1TXEN
#define LL_AHB1_GRP1_PERIPH_ETH1RX         RCC_AHB1ENR_ETH1RXEN
#define LL_AHB1_GRP1_PERIPH_USBOTGHS       RCC_AHB1ENR_OTGHSEN
#define LL_AHB1_GRP1_PERIPH_USBOTGFS       RCC_AHB1ENR_OTGFSEN
#define LL_AHB1_GRP1_PERIPH_USBPHYC        RCC_AHB1ENR_USBPHYCEN
#define LL_AHB1_GRP1_PERIPH_ADF1           RCC_AHB1ENR_ADF1EN
/**
  * @}
  */

/** @defgroup BUS_LL_EC_AHB2_GRP1_PERIPH  AHB2 GRP1 PERIPH
  * @{
  */
#define LL_AHB2_GRP1_PERIPH_PSSI           RCC_AHB2ENR_PSSIEN
#define LL_AHB2_GRP1_PERIPH_SDMMC2         RCC_AHB2ENR_SDMMC2EN
#define LL_AHB2_GRP1_PERIPH_CORDIC         RCC_AHB2ENR_CORDICEN
#define LL_AHB2_GRP1_PERIPH_AHBSRAM1       RCC_AHB2ENR_SRAM1EN
#define LL_AHB2_GRP1_PERIPH_AHBSRAM2       RCC_AHB2ENR_SRAM2EN
/**
  * @}
  */

/** @defgroup BUS_LL_EC_AHB3_GRP1_PERIPH  AHB3 GRP1 PERIPH
  * @{
  */
#define LL_AHB3_GRP1_PERIPH_RNG            RCC_AHB3ENR_RNGEN
#define LL_AHB3_GRP1_PERIPH_HASH           RCC_AHB3ENR_HASHEN
#if defined(CRYP)
#define LL_AHB3_GRP1_PERIPH_CRYP           RCC_AHB3ENR_CRYPEN
#endif /* CRYP */
#if defined(SAES)
#define LL_AHB3_GRP1_PERIPH_SAES           RCC_AHB3ENR_SAESEN
#endif /* SAES */
#define LL_AHB3_GRP1_PERIPH_PKA            RCC_AHB3ENR_PKAEN
/**
  * @}
  */

/** @defgroup BUS_LL_EC_AHB4_GRP1_PERIPH  AHB4 GRP1 PERIPH
  * @{
  */
#define LL_AHB4_GRP1_PERIPH_GPIOA          RCC_AHB4ENR_GPIOAEN
#define LL_AHB4_GRP1_PERIPH_GPIOB          RCC_AHB4ENR_GPIOBEN
#define LL_AHB4_GRP1_PERIPH_GPIOC          RCC_AHB4ENR_GPIOCEN
#define LL_AHB4_GRP1_PERIPH_GPIOD          RCC_AHB4ENR_GPIODEN
#define LL_AHB4_GRP1_PERIPH_GPIOE          RCC_AHB4ENR_GPIOEEN
#define LL_AHB4_GRP1_PERIPH_GPIOF          RCC_AHB4ENR_GPIOFEN
#define LL_AHB4_GRP1_PERIPH_GPIOG          RCC_AHB4ENR_GPIOGEN
#define LL_AHB4_GRP1_PERIPH_GPIOH          RCC_AHB4ENR_GPIOHEN
#define LL_AHB4_GRP1_PERIPH_GPIOM          RCC_AHB4ENR_GPIOMEN
#define LL_AHB4_GRP1_PERIPH_GPION          RCC_AHB4ENR_GPIONEN
#define LL_AHB4_GRP1_PERIPH_GPIOO          RCC_AHB4ENR_GPIOOEN
#define LL_AHB4_GRP1_PERIPH_GPIOP          RCC_AHB4ENR_GPIOPEN
#define LL_AHB4_GRP1_PERIPH_CRC            RCC_AHB4ENR_CRCEN
#define LL_AHB4_GRP1_PERIPH_BKPRAM         RCC_AHB4ENR_BKPRAMEN
/**
  * @}
  */

/** @defgroup BUS_LL_EC_AHB5_GRP1_PERIPH  AHB5 GRP1 PERIPH
  * @{
  */
#define LL_AHB5_GRP1_PERIPH_HPDMA1         RCC_AHB5ENR_HPDMA1EN
#define LL_AHB5_GRP1_PERIPH_DMA2D          RCC_AHB5ENR_DMA2DEN
#define LL_AHB5_GRP1_PERIPH_JPEG           RCC_AHB5ENR_JPEGEN
#define LL_AHB5_GRP1_PERIPH_FMC            RCC_AHB5ENR_FMCEN
#define LL_AHB5_GRP1_PERIPH_XSPI1          RCC_AHB5ENR_XSPI1EN
#define LL_AHB5_GRP1_PERIPH_XSPI2          RCC_AHB5ENR_XSPI2EN
#define LL_AHB5_GRP1_PERIPH_XSPIM          RCC_AHB5ENR_XSPIMEN
#define LL_AHB5_GRP1_PERIPH_SDMMC1         RCC_AHB5ENR_SDMMC1EN
#define LL_AHB5_GRP1_PERIPH_GFXMMU         RCC_AHB5ENR_GFXMMUEN
#if defined(GPU2D)
#define LL_AHB5_GRP1_PERIPH_GPU2D          RCC_AHB5ENR_GPU2DEN
#endif /* GPU2D */

#define LL_AHB5_GRP1_PERIPH_FLASH          RCC_AHB5LPENR_FLASHLPEN
#define LL_AHB5_GRP1_PERIPH_AXISRAM        RCC_AHB5LPENR_AXISRAMLPEN
#define LL_AHB5_GRP1_PERIPH_DTCM1          RCC_AHB5LPENR_DTCM1LPEN
#define LL_AHB5_GRP1_PERIPH_DTCM2          RCC_AHB5LPENR_DTCM2LPEN
#define LL_AHB5_GRP1_PERIPH_ITCM           RCC_AHB5LPENR_ITCMLPEN
/**
  * @}
  */

/** @defgroup BUS_LL_EC_APB1_GRP1_PERIPH  APB1 GRP1 PERIPH
  * @{
  */
#define LL_APB1_GRP1_PERIPH_TIM2           RCC_APB1ENR1_TIM2EN
#define LL_APB1_GRP1_PERIPH_TIM3           RCC_APB1ENR1_TIM3EN
#define LL_APB1_GRP1_PERIPH_TIM4           RCC_APB1ENR1_TIM4EN
#define LL_APB1_GRP1_PERIPH_TIM5           RCC_APB1ENR1_TIM5EN
#define LL_APB1_GRP1_PERIPH_TIM6           RCC_APB1ENR1_TIM6EN
#define LL_APB1_GRP1_PERIPH_TIM7           RCC_APB1ENR1_TIM7EN
#define LL_APB1_GRP1_PERIPH_TIM12          RCC_APB1ENR1_TIM12EN
#define LL_APB1_GRP1_PERIPH_TIM13          RCC_APB1ENR1_TIM13EN
#define LL_APB1_GRP1_PERIPH_TIM14          RCC_APB1ENR1_TIM14EN
#define LL_APB1_GRP1_PERIPH_LPTIM1         RCC_APB1ENR1_LPTIM1EN
#define LL_APB1_GRP1_PERIPH_WWDG           RCC_APB1ENR1_WWDGEN
#define LL_APB1_GRP1_PERIPH_SPI2           RCC_APB1ENR1_SPI2EN
#define LL_APB1_GRP1_PERIPH_SPI3           RCC_APB1ENR1_SPI3EN
#define LL_APB1_GRP1_PERIPH_SPDIFRX        RCC_APB1ENR1_SPDIFRXEN
#define LL_APB1_GRP1_PERIPH_USART2         RCC_APB1ENR1_USART2EN
#define LL_APB1_GRP1_PERIPH_USART3         RCC_APB1ENR1_USART3EN
#define LL_APB1_GRP1_PERIPH_UART4          RCC_APB1ENR1_UART4EN
#define LL_APB1_GRP1_PERIPH_UART5          RCC_APB1ENR1_UART5EN
#define LL_APB1_GRP1_PERIPH_I2C1           RCC_APB1ENR1_I2C1_I3C1EN
#define LL_APB1_GRP1_PERIPH_I2C2           RCC_APB1ENR1_I2C2EN
#define LL_APB1_GRP1_PERIPH_I2C3           RCC_APB1ENR1_I2C3EN
#define LL_APB1_GRP1_PERIPH_I3C1           RCC_APB1ENR1_I2C1_I3C1EN
#define LL_APB1_GRP1_PERIPH_CEC            RCC_APB1ENR1_CECEN
#define LL_APB1_GRP1_PERIPH_UART7          RCC_APB1ENR1_UART7EN
#define LL_APB1_GRP1_PERIPH_UART8          RCC_APB1ENR1_UART8EN
/**
  * @}
  */

