RT-Thread/rt-thread/bsp/stm32/libraries/STM32H7RSxx_HAL/STM32H7RSxx_HAL_Driver/Inc/stm32h7rsxx_ll_bus.h
/** @defgroup BUS_LL_EC_APB1_GRP2_PERIPH  APB1 GRP2 PERIPH
  * @{
  */
#define LL_APB1_GRP2_PERIPH_CRS            RCC_APB1ENR2_CRSEN
#define LL_APB1_GRP2_PERIPH_MDIOS          RCC_APB1ENR2_MDIOSEN
#define LL_APB1_GRP2_PERIPH_FDCAN          RCC_APB1ENR2_FDCANEN
#define LL_APB1_GRP2_PERIPH_UCPD1          RCC_APB1ENR2_UCPD1EN
/**
  * @}
  */

/** @defgroup BUS_LL_EC_APB2_GRP1_PERIPH  APB2 GRP1 PERIPH
  * @{
  */
#define LL_APB2_GRP1_PERIPH_TIM1           RCC_APB2ENR_TIM1EN
#define LL_APB2_GRP1_PERIPH_USART1         RCC_APB2ENR_USART1EN
#define LL_APB2_GRP1_PERIPH_SPI1           RCC_APB2ENR_SPI1EN
#define LL_APB2_GRP1_PERIPH_SPI4           RCC_APB2ENR_SPI4EN
#define LL_APB2_GRP1_PERIPH_TIM15          RCC_APB2ENR_TIM15EN
#define LL_APB2_GRP1_PERIPH_TIM16          RCC_APB2ENR_TIM16EN
#define LL_APB2_GRP1_PERIPH_TIM17          RCC_APB2ENR_TIM17EN
#define LL_APB2_GRP1_PERIPH_TIM9           RCC_APB2ENR_TIM9EN
#define LL_APB2_GRP1_PERIPH_SPI5           RCC_APB2ENR_SPI5EN
#define LL_APB2_GRP1_PERIPH_SAI1           RCC_APB2ENR_SAI1EN
#define LL_APB2_GRP1_PERIPH_SAI2           RCC_APB2ENR_SAI2EN
/**
  * @}
  */

/** @defgroup BUS_LL_EC_APB4_GRP1_PERIPH  APB4 GRP1 PERIPH
  * @{
  */
#define LL_APB4_GRP1_PERIPH_SBS            RCC_APB4ENR_SBSEN
#define LL_APB4_GRP1_PERIPH_LPUART1        RCC_APB4ENR_LPUART1EN
#define LL_APB4_GRP1_PERIPH_SPI6           RCC_APB4ENR_SPI6EN
#define LL_APB4_GRP1_PERIPH_LPTIM2         RCC_APB4ENR_LPTIM2EN
#define LL_APB4_GRP1_PERIPH_LPTIM3         RCC_APB4ENR_LPTIM3EN
#define LL_APB4_GRP1_PERIPH_LPTIM4         RCC_APB4ENR_LPTIM4EN
#define LL_APB4_GRP1_PERIPH_LPTIM5         RCC_APB4ENR_LPTIM5EN
#define LL_APB4_GRP1_PERIPH_VREF           RCC_APB4ENR_VREFEN
#define LL_APB4_GRP1_PERIPH_RTCAPB         RCC_APB4ENR_RTCAPBEN
#define LL_APB4_GRP1_PERIPH_DTS            RCC_APB4ENR_DTSEN
/**
  * @}
  */

/** @defgroup BUS_LL_EC_APB5_GRP1_PERIPH  APB5 GRP1 PERIPH
  * @{
  */
#if defined(LTDC)
#define LL_APB5_GRP1_PERIPH_LTDC           RCC_APB5ENR_LTDCEN
#endif /* LTDC */
#define LL_APB5_GRP1_PERIPH_DCMIPP         RCC_APB5ENR_DCMIPPEN
#define LL_APB5_GRP1_PERIPH_GFXTIM         RCC_APB5ENR_GFXTIMEN
/**
  * @}
  */

/** @defgroup BUS_LL_EC_CKGA_PERIPH  CKGA (AXI Clocks Gating) PERIPH
  * @{
  */
#define LL_CKGA_PERIPH_AXI                 RCC_CKGDISR_AXICKG
#define LL_CKGA_PERIPH_AHBM                RCC_CKGDISR_AHBMCKG
#define LL_CKGA_PERIPH_SDMMC1              RCC_CKGDISR_SDMMC1CKG
#define LL_CKGA_PERIPH_HPDMA1              RCC_CKGDISR_HPDMA1CKG
#define LL_CKGA_PERIPH_CPU                 RCC_CKGDISR_CPUCKG
#if defined(GPU2D)
#define LL_CKGA_PERIPH_GPU2DS1             RCC_CKGDISR_GPU2DS1CKG
#define LL_CKGA_PERIPH_GPU2DS0             RCC_CKGDISR_GPU2DS0CKG
#define LL_CKGA_PERIPH_GPU2DCL             RCC_CKGDISR_GPU2DCLCKG
#endif /* GPU2D */
#define LL_CKGA_PERIPH_DCMIPP              RCC_CKGDISR_DCMIPPCKG
#define LL_CKGA_PERIPH_DMA2D               RCC_CKGDISR_DMA2DCKG
#define LL_CKGA_PERIPH_GFXMMUS             RCC_CKGDISR_GFXMMUSCKG
#if defined(LTDC)
#define LL_CKGA_PERIPH_LTDC                RCC_CKGDISR_LTDCCKG
#endif /* LTDC */
#define LL_CKGA_PERIPH_GFXMMUM             RCC_CKGDISR_GFXMMUMCKG
#define LL_CKGA_PERIPH_AHBS                RCC_CKGDISR_AHBSCKG
#define LL_CKGA_PERIPH_FMC                 RCC_CKGDISR_FMCCKG
#define LL_CKGA_PERIPH_XSPI1               RCC_CKGDISR_XSPI1CKG
#define LL_CKGA_PERIPH_XSPI2               RCC_CKGDISR_XSPI2CKG
#define LL_CKGA_PERIPH_AXIRAM1             RCC_CKGDISR_AXISRAM1CKG
#define LL_CKGA_PERIPH_AXIRAM2             RCC_CKGDISR_AXISRAM2CKG
#define LL_CKGA_PERIPH_AXIRAM3             RCC_CKGDISR_AXISRAM3CKG
#define LL_CKGA_PERIPH_AXIRAM4             RCC_CKGDISR_AXISRAM4CKG
#define LL_CKGA_PERIPH_FLASH               RCC_CKGDISR_FLASHCKG
#define LL_CKGA_PERIPH_EXTI                RCC_CKGDISR_EXTICKG
#define LL_CKGA_PERIPH_JTAG                RCC_CKGDISR_JTAGCKG
/**
  * @}
  */

/**
  * @}
  */
/* Exported macro ------------------------------------------------------------*/

/* Exported functions --------------------------------------------------------*/

/** @defgroup BUS_LL_Exported_Functions BUS Exported Functions
  * @{
  */

/** @defgroup BUS_LL_EF_AHB1 AHB1
  * @{
  */

/**
  * @brief  Enable AHB1 peripherals clock.
  * @rmtoll AHB1ENR      GPDMA1EN      LL_AHB1_GRP1_EnableClock\n
  *         AHB1ENR      ADC12EN       LL_AHB1_GRP1_EnableClock\n
  *         AHB1ENR      ETH1MACEN     LL_AHB1_GRP1_EnableClock\n
  *         AHB1ENR      ETH1TXEN      LL_AHB1_GRP1_EnableClock\n
  *         AHB1ENR      ETH1RXEN      LL_AHB1_GRP1_EnableClock\n
  *         AHB1ENR      OTGFSEN       LL_AHB1_GRP1_EnableClock\n
  *         AHB1ENR      OTGHSEN       LL_AHB1_GRP1_EnableClock\n
  *         AHB1ENR      USBPHYCEN     LL_AHB1_GRP1_EnableClock\n
  *         AHB1ENR      ADF1EN        LL_AHB1_GRP1_EnableClock
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_AHB1_GRP1_PERIPH_GPDMA1
  *         @arg @ref LL_AHB1_GRP1_PERIPH_ADC12
  *         @arg @ref LL_AHB1_GRP1_PERIPH_ETH1MAC
  *         @arg @ref LL_AHB1_GRP1_PERIPH_ETH1TX
  *         @arg @ref LL_AHB1_GRP1_PERIPH_ETH1RX
  *         @arg @ref LL_AHB1_GRP1_PERIPH_USBOTGHS
  *         @arg @ref LL_AHB1_GRP1_PERIPH_USBOTGFS
  *         @arg @ref LL_AHB1_GRP1_PERIPH_USBPHYC
  *         @arg @ref LL_AHB1_GRP1_PERIPH_ADF1
  * @retval None
  */
__STATIC_INLINE void LL_AHB1_GRP1_EnableClock(uint32_t Periphs)
{
  __IO uint32_t tmpreg;
  SET_BIT(RCC->AHB1ENR, Periphs);
  /* Delay after an RCC peripheral clock enabling */
  tmpreg = READ_BIT(RCC->AHB1ENR, Periphs);
  (void)tmpreg;
}

/**
  * @brief  Check if AHB1 peripheral clock is enabled or not
  * @rmtoll AHB1ENR      GPDMA1EN      LL_AHB1_GRP1_IsEnabledClock\n
  *         AHB1ENR      ADC12EN       LL_AHB1_GRP1_IsEnabledClock\n
  *         AHB1ENR      ETH1MACEN     LL_AHB1_GRP1_IsEnabledClock\n
  *         AHB1ENR      ETH1TXEN      LL_AHB1_GRP1_IsEnabledClock\n
  *         AHB1ENR      ETH1RXEN      LL_AHB1_GRP1_IsEnabledClock\n
  *         AHB1ENR      OTGHSEN       LL_AHB1_GRP1_IsEnabledClock\n
  *         AHB1ENR      OTGFSEN       LL_AHB1_GRP1_IsEnabledClock\n
  *         AHB1ENR      USBPHYCEN     LL_AHB1_GRP1_IsEnabledClock\n
  *         AHB1ENR      ADF1EN        LL_AHB1_GRP1_IsEnabledClock
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_AHB1_GRP1_PERIPH_GPDMA1
  *         @arg @ref LL_AHB1_GRP1_PERIPH_ADC12
  *         @arg @ref LL_AHB1_GRP1_PERIPH_ETH1MAC
  *         @arg @ref LL_AHB1_GRP1_PERIPH_ETH1TX
  *         @arg @ref LL_AHB1_GRP1_PERIPH_ETH1RX
  *         @arg @ref LL_AHB1_GRP1_PERIPH_USBOTGHS
  *         @arg @ref LL_AHB1_GRP1_PERIPH_USBOTGFS
  *         @arg @ref LL_AHB1_GRP1_PERIPH_USBPHYC
  *         @arg @ref LL_AHB1_GRP1_PERIPH_ADF1
  * @retval uint32_t
  */
__STATIC_INLINE uint32_t LL_AHB1_GRP1_IsEnabledClock(uint32_t Periphs)
{
  return ((READ_BIT(RCC->AHB1ENR, Periphs) == Periphs) ? 1U : 0U);
}

/**
  * @brief  Disable AHB1 peripherals clock.
  * @rmtoll AHB1ENR      GPDMA1EN      LL_AHB1_GRP1_DisableClock\n
  *         AHB1ENR      ADC12EN       LL_AHB1_GRP1_DisableClock\n
  *         AHB1ENR      ETH1MACEN     LL_AHB1_GRP1_DisableClock\n
  *         AHB1ENR      ETH1TXEN      LL_AHB1_GRP1_DisableClock\n
  *         AHB1ENR      ETH1RXEN      LL_AHB1_GRP1_DisableClock\n
  *         AHB1ENR      OTGHSEN       LL_AHB1_GRP1_DisableClock\n
  *         AHB1ENR      OTGFSEN       LL_AHB1_GRP1_DisableClock\n
  *         AHB1ENR      USBPHYCEN     LL_AHB1_GRP1_DisableClock\n
  *         AHB1ENR      ADF1EN        LL_AHB1_GRP1_DisableClock
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_AHB1_GRP1_PERIPH_GPDMA1
  *         @arg @ref LL_AHB1_GRP1_PERIPH_ADC12
  *         @arg @ref LL_AHB1_GRP1_PERIPH_ETH1MAC
  *         @arg @ref LL_AHB1_GRP1_PERIPH_ETH1TX
  *         @arg @ref LL_AHB1_GRP1_PERIPH_ETH1RX
  *         @arg @ref LL_AHB1_GRP1_PERIPH_USBOTGHS
  *         @arg @ref LL_AHB1_GRP1_PERIPH_USBOTGFS
  *         @arg @ref LL_AHB1_GRP1_PERIPH_USBPHYC
  *         @arg @ref LL_AHB1_GRP1_PERIPH_ADF1
  * @retval None
  */
__STATIC_INLINE void LL_AHB1_GRP1_DisableClock(uint32_t Periphs)
{
  CLEAR_BIT(RCC->AHB1ENR, Periphs);
}

/**
  * @brief  Force AHB1 peripherals reset.
  * @rmtoll AHB1RSTR     GPDMA1RST     LL_AHB1_GRP1_ForceReset\n
  *         AHB1RSTR     ADC12RST      LL_AHB1_GRP1_ForceReset\n
  *         AHB1RSTR     ETH1RST       LL_AHB1_GRP1_ForceReset\n
  *         AHB1RSTR     OTGHSRST      LL_AHB1_GRP1_ForceReset\n
  *         AHB1RSTR     OTGFSRST      LL_AHB1_GRP1_ForceReset\n
  *         AHB1RSTR     USBPHYCRST    LL_AHB1_GRP1_ForceReset\n
  *         AHB1RSTR     ADF1RST       LL_AHB1_GRP1_ForceReset
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_AHB1_GRP1_PERIPH_GPDMA1
  *         @arg @ref LL_AHB1_GRP1_PERIPH_ADC12
  *         @arg @ref LL_AHB1_GRP1_PERIPH_ETH1MAC
  *         @arg @ref LL_AHB1_GRP1_PERIPH_USBOTGHS
  *         @arg @ref LL_AHB1_GRP1_PERIPH_USBOTGFS
  *         @arg @ref LL_AHB1_GRP1_PERIPH_USBPHYC
  *         @arg @ref LL_AHB1_GRP1_PERIPH_ADF1
  * @retval None
  */
__STATIC_INLINE void LL_AHB1_GRP1_ForceReset(uint32_t Periphs)
{
  SET_BIT(RCC->AHB1RSTR, Periphs);
}

/**
  * @brief  Release AHB1 peripherals reset.
  * @rmtoll AHB1RSTR     GPDMA1RST     LL_AHB1_GRP1_ReleaseReset\n
  *         AHB1RSTR     ADC12RST      LL_AHB1_GRP1_ReleaseReset\n
  *         AHB1RSTR     ETH1RST       LL_AHB1_GRP1_ReleaseReset\n
  *         AHB1RSTR     OTGHSRST      LL_AHB1_GRP1_ReleaseReset\n
  *         AHB1RSTR     OTGFSRST      LL_AHB1_GRP1_ReleaseReset\n
  *         AHB1RSTR     USBPHYCRST    LL_AHB1_GRP1_ReleaseReset\n
  *         AHB1RSTR     ADF1RST       LL_AHB1_GRP1_ReleaseReset
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_AHB1_GRP1_PERIPH_GPDMA1
  *         @arg @ref LL_AHB1_GRP1_PERIPH_ADC12
  *         @arg @ref LL_AHB1_GRP1_PERIPH_ETH1MAC
  *         @arg @ref LL_AHB1_GRP1_PERIPH_USBOTGHS
  *         @arg @ref LL_AHB1_GRP1_PERIPH_USBOTGFS
  *         @arg @ref LL_AHB1_GRP1_PERIPH_USBPHYC
  *         @arg @ref LL_AHB1_GRP1_PERIPH_ADF1
  * @retval None
  */
__STATIC_INLINE void LL_AHB1_GRP1_ReleaseReset(uint32_t Periphs)
{
  CLEAR_BIT(RCC->AHB1RSTR, Periphs);
}

/**
  * @brief  Enable AHB1 peripherals clock during Low Power (Sleep) mode.
  * @rmtoll AHB1LPENR    GPDMA1LPEN    LL_AHB1_GRP1_EnableClockSleep\n
  *         AHB1LPENR    ADC12LPEN     LL_AHB1_GRP1_EnableClockSleep\n
  *         AHB1LPENR    ETH1MACLPEN   LL_AHB1_GRP1_EnableClockSleep\n
  *         AHB1LPENR    ETH1TXLPEN    LL_AHB1_GRP1_EnableClockSleep\n
  *         AHB1LPENR    ETH1RXLPEN    LL_AHB1_GRP1_EnableClockSleep\n
  *         AHB1LPENR    OTGHSLPEN     LL_AHB1_GRP1_EnableClockSleep\n
  *         AHB1LPENR    OTGFSLPEN     LL_AHB1_GRP1_EnableClockSleep\n
  *         AHB1LPENR    USBPHYCLPEN   LL_AHB1_GRP1_EnableClockSleep\n
  *         AHB1LPENR    ADF1LPEN      LL_AHB1_GRP1_EnableClockSleep
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_AHB1_GRP1_PERIPH_GPDMA1
  *         @arg @ref LL_AHB1_GRP1_PERIPH_ADC12
  *         @arg @ref LL_AHB1_GRP1_PERIPH_ETH1MAC
  *         @arg @ref LL_AHB1_GRP1_PERIPH_ETH1TX
  *         @arg @ref LL_AHB1_GRP1_PERIPH_ETH1RX
  *         @arg @ref LL_AHB1_GRP1_PERIPH_USBOTGHS
  *         @arg @ref LL_AHB1_GRP1_PERIPH_USBOTGFS
  *         @arg @ref LL_AHB1_GRP1_PERIPH_USBPHYC
  *         @arg @ref LL_AHB1_GRP1_PERIPH_ADF1
  * @retval None
  */
__STATIC_INLINE void LL_AHB1_GRP1_EnableClockSleep(uint32_t Periphs)
{
  __IO uint32_t tmpreg;
  SET_BIT(RCC->AHB1LPENR, Periphs);
  /* Delay after an RCC peripheral clock enabling */
  tmpreg = READ_BIT(RCC->AHB1LPENR, Periphs);
  (void)tmpreg;
}

/**
  * @brief  Disable AHB1 peripherals clock during Low Power (Sleep) mode.
  * @rmtoll AHB1LPENR    GPDMA1LPEN    LL_AHB1_GRP1_DisableClockSleep\n
  *         AHB1LPENR    ADC12LPEN     LL_AHB1_GRP1_DisableClockSleep\n
  *         AHB1LPENR    ETH1MACLPEN   LL_AHB1_GRP1_DisableClockSleep\n
  *         AHB1LPENR    ETH1TXLPEN    LL_AHB1_GRP1_DisableClockSleep\n
  *         AHB1LPENR    ETH1RXLPEN    LL_AHB1_GRP1_DisableClockSleep\n
  *         AHB1LPENR    OTGHSLPEN     LL_AHB1_GRP1_DisableClockSleep\n
  *         AHB1LPENR    OTGHSLPEN     LL_AHB1_GRP1_DisableClockSleep\n
  *         AHB1LPENR    USBPHYCLPEN   LL_AHB1_GRP1_DisableClockSleep\n
  *         AHB1LPENR    ADF1LPEN      LL_AHB1_GRP1_DisableClockSleep
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_AHB1_GRP1_PERIPH_GPDMA1
  *         @arg @ref LL_AHB1_GRP1_PERIPH_ADC12
  *         @arg @ref LL_AHB1_GRP1_PERIPH_ETH1MAC
  *         @arg @ref LL_AHB1_GRP1_PERIPH_ETH1TX
  *         @arg @ref LL_AHB1_GRP1_PERIPH_ETH1RX
  *         @arg @ref LL_AHB1_GRP1_PERIPH_USBOTGHS
  *         @arg @ref LL_AHB1_GRP1_PERIPH_USBOTGFS
  *         @arg @ref LL_AHB1_GRP1_PERIPH_USBPHYC
  *         @arg @ref LL_AHB1_GRP1_PERIPH_ADF1
  * @retval None
  */
__STATIC_INLINE void LL_AHB1_GRP1_DisableClockSleep(uint32_t Periphs)
{
  CLEAR_BIT(RCC->AHB1LPENR, Periphs);
}

/**
  * @}
  */

