RT-Thread/rt-thread/bsp/stm32/libraries/STM32H7RSxx_HAL/STM32H7RSxx_HAL_Driver/Inc/stm32h7rsxx_ll_bus.h
/** @defgroup BUS_LL_EF_AHB2 AHB2
  * @{
  */

/**
  * @brief  Enable AHB2 peripherals clock.
  * @rmtoll AHB2ENR      PSSIEN        LL_AHB2_GRP1_EnableClock\n
  *         AHB2ENR      SDMMC2EN      LL_AHB2_GRP1_EnableClock\n
  *         AHB2ENR      CORDICEN      LL_AHB2_GRP1_EnableClock\n
  *         AHB2ENR      AHBSRAM1EN    LL_AHB2_GRP1_EnableClock\n
  *         AHB2ENR      AHBSRAM2EN    LL_AHB2_GRP1_EnableClock
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_AHB2_GRP1_PERIPH_PSSI
  *         @arg @ref LL_AHB2_GRP1_PERIPH_SDMMC2
  *         @arg @ref LL_AHB2_GRP1_PERIPH_CORDIC
  *         @arg @ref LL_AHB2_GRP1_PERIPH_AHBSRAM1
  *         @arg @ref LL_AHB2_GRP1_PERIPH_AHBSRAM2
  * @retval None
  */
__STATIC_INLINE void LL_AHB2_GRP1_EnableClock(uint32_t Periphs)
{
  __IO uint32_t tmpreg;
  SET_BIT(RCC->AHB2ENR, Periphs);
  /* Delay after an RCC peripheral clock enabling */
  tmpreg = READ_BIT(RCC->AHB2ENR, Periphs);
  (void)tmpreg;
}

/**
  * @brief  Check if AHB2 peripheral clock is enabled or not
  * @rmtoll AHB2ENR      PSSIEN        LL_AHB2_GRP1_IsEnabledClock\n
  *         AHB2ENR      SDMMC2EN      LL_AHB2_GRP1_IsEnabledClock\n
  *         AHB2ENR      CORDICEN      LL_AHB2_GRP1_IsEnabledClock\n
  *         AHB2ENR      AHBSRAM1EN    LL_AHB2_GRP1_IsEnabledClock\n
  *         AHB2ENR      AHBSRAM2EN    LL_AHB2_GRP1_IsEnabledClock
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_AHB2_GRP1_PERIPH_PSSI
  *         @arg @ref LL_AHB2_GRP1_PERIPH_SDMMC2
  *         @arg @ref LL_AHB2_GRP1_PERIPH_CORDIC
  *         @arg @ref LL_AHB2_GRP1_PERIPH_AHBSRAM1
  *         @arg @ref LL_AHB2_GRP1_PERIPH_AHBSRAM2
  * @retval uint32_t
  */
__STATIC_INLINE uint32_t LL_AHB2_GRP1_IsEnabledClock(uint32_t Periphs)
{
  return ((READ_BIT(RCC->AHB2ENR, Periphs) == Periphs) ? 1U : 0U);
}

/**
  * @brief  Disable AHB2 peripherals clock.
  * @rmtoll AHB2ENR      PSSIEN        LL_AHB2_GRP1_DisableClock\n
  *         AHB2ENR      SDMMC2EN      LL_AHB2_GRP1_DisableClock\n
  *         AHB2ENR      CORDICEN      LL_AHB2_GRP1_DisableClock\n
  *         AHB2ENR      AHBSRAM1EN    LL_AHB2_GRP1_DisableClock\n
  *         AHB2ENR      AHBSRAM2EN    LL_AHB2_GRP1_DisableClock
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_AHB2_GRP1_PERIPH_PSSI
  *         @arg @ref LL_AHB2_GRP1_PERIPH_SDMMC2
  *         @arg @ref LL_AHB2_GRP1_PERIPH_CORDIC
  *         @arg @ref LL_AHB2_GRP1_PERIPH_AHBSRAM1
  *         @arg @ref LL_AHB2_GRP1_PERIPH_AHBSRAM2
  * @retval None
  */
__STATIC_INLINE void LL_AHB2_GRP1_DisableClock(uint32_t Periphs)
{
  CLEAR_BIT(RCC->AHB2ENR, Periphs);
}

/**
  * @brief  Force AHB2 peripherals reset.
  * @rmtoll AHB2RSTR     PSSIRST        LL_AHB2_GRP1_ForceReset\n
  *         AHB2RSTR     SDMMC2RST      LL_AHB2_GRP1_ForceReset\n
  *         AHB2RSTR     CORDICRST      LL_AHB2_GRP1_ForceReset
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_AHB2_GRP1_PERIPH_PSSI
  *         @arg @ref LL_AHB2_GRP1_PERIPH_SDMMC2
  *         @arg @ref LL_AHB2_GRP1_PERIPH_CORDIC
  * @retval None
  */
__STATIC_INLINE void LL_AHB2_GRP1_ForceReset(uint32_t Periphs)
{
  SET_BIT(RCC->AHB2RSTR, Periphs);
}

/**
  * @brief  Release AHB2 peripherals reset.
  * @rmtoll AHB2RSTR     PSSIRST        LL_AHB2_GRP1_ReleaseReset\n
  *         AHB2RSTR     SDMMC2RST      LL_AHB2_GRP1_ReleaseReset\n
  *         AHB2RSTR     CORDICRST      LL_AHB2_GRP1_ReleaseReset
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_AHB2_GRP1_PERIPH_PSSI
  *         @arg @ref LL_AHB2_GRP1_PERIPH_SDMMC2
  *         @arg @ref LL_AHB2_GRP1_PERIPH_CORDIC
  * @retval None
  */
__STATIC_INLINE void LL_AHB2_GRP1_ReleaseReset(uint32_t Periphs)
{
  CLEAR_BIT(RCC->AHB2RSTR, Periphs);
}

/**
  * @brief  Enable AHB2 peripherals clock during Low Power (Sleep) mode.
  * @rmtoll AHB2LPENR    PSSILPEN      LL_AHB2_GRP1_EnableClockSleep\n
  *         AHB2LPENR    SDMMC2LPEN    LL_AHB2_GRP1_EnableClockSleep\n
  *         AHB2LPENR    CORDICLPEN    LL_AHB2_GRP1_EnableClockSleep\n
  *         AHB2LPENR    AHBSRAM1LPEN  LL_AHB2_GRP1_EnableClockSleep\n
  *         AHB2LPENR    AHBSRAM2LPEN  LL_AHB2_GRP1_EnableClockSleep
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_AHB2_GRP1_PERIPH_PSSI
  *         @arg @ref LL_AHB2_GRP1_PERIPH_SDMMC2
  *         @arg @ref LL_AHB2_GRP1_PERIPH_CORDIC
  *         @arg @ref LL_AHB2_GRP1_PERIPH_AHBSRAM1
  *         @arg @ref LL_AHB2_GRP1_PERIPH_AHBSRAM2
  * @retval None
  */
__STATIC_INLINE void LL_AHB2_GRP1_EnableClockSleep(uint32_t Periphs)
{
  __IO uint32_t tmpreg;
  SET_BIT(RCC->AHB2LPENR, Periphs);
  /* Delay after an RCC peripheral clock enabling */
  tmpreg = READ_BIT(RCC->AHB2LPENR, Periphs);
  (void)tmpreg;
}

/**
  * @brief  Disable AHB2 peripherals clock during Low Power (Sleep) mode.
  * @rmtoll AHB2LPENR    PSSILPEN      LL_AHB2_GRP1_DisableClockSleep\n
  *         AHB2LPENR    SDMMC2LPEN    LL_AHB2_GRP1_DisableClockSleep\n
  *         AHB2LPENR    CORDICLPEN    LL_AHB2_GRP1_DisableClockSleep\n
  *         AHB2LPENR    AHBSRAM1LPEN  LL_AHB2_GRP1_DisableClockSleep\n
  *         AHB2LPENR    AHBSRAM2LPEN  LL_AHB2_GRP1_DisableClockSleep
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_AHB2_GRP1_PERIPH_PSSI
  *         @arg @ref LL_AHB2_GRP1_PERIPH_SDMMC2
  *         @arg @ref LL_AHB2_GRP1_PERIPH_CORDIC
  *         @arg @ref LL_AHB2_GRP1_PERIPH_AHBSRAM1
  *         @arg @ref LL_AHB2_GRP1_PERIPH_AHBSRAM2
  * @retval None
  */
__STATIC_INLINE void LL_AHB2_GRP1_DisableClockSleep(uint32_t Periphs)
{
  CLEAR_BIT(RCC->AHB2LPENR, Periphs);
}

/**
  * @}
  */

/** @defgroup BUS_LL_EF_AHB3 AHB3
  * @{
  */

/**
  * @brief  Enable AHB3 peripherals clock.
  * @rmtoll AHB3ENR      RNGEN         LL_AHB3_GRP1_EnableClock\n
  *         AHB3ENR      HASHEN        LL_AHB3_GRP1_EnableClock\n
  *         AHB3ENR      CRYPEN        LL_AHB3_GRP1_EnableClock\n
  *         AHB3ENR      SAESEN        LL_AHB3_GRP1_EnableClock\n
  *         AHB3ENR      PKAEN         LL_AHB3_GRP1_EnableClock
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_AHB3_GRP1_PERIPH_RNG
  *         @arg @ref LL_AHB3_GRP1_PERIPH_HASH
  *         @arg @ref LL_AHB3_GRP1_PERIPH_CRYP (*)
  *         @arg @ref LL_AHB3_GRP1_PERIPH_SAES (*)
  *         @arg @ref LL_AHB3_GRP1_PERIPH_PKA
  *
  *         (*) value not defined in all devices.
  * @retval None
  */
__STATIC_INLINE void LL_AHB3_GRP1_EnableClock(uint32_t Periphs)
{
  __IO uint32_t tmpreg;
  SET_BIT(RCC->AHB3ENR, Periphs);
  /* Delay after an RCC peripheral clock enabling */
  tmpreg = READ_BIT(RCC->AHB3ENR, Periphs);
  (void)tmpreg;
}

/**
  * @brief  Check if AHB3 peripheral clock is enabled or not
  * @rmtoll AHB3ENR      RNGEN         LL_AHB3_GRP1_IsEnabledClock\n
  *         AHB3ENR      HASHEN        LL_AHB3_GRP1_IsEnabledClock\n
  *         AHB3ENR      CRYPEN        LL_AHB3_GRP1_IsEnabledClock\n
  *         AHB3ENR      SAESEN        LL_AHB3_GRP1_IsEnabledClock\n
  *         AHB3ENR      PKAEN         LL_AHB3_GRP1_IsEnabledClock
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_AHB3_GRP1_PERIPH_RNG
  *         @arg @ref LL_AHB3_GRP1_PERIPH_HASH
  *         @arg @ref LL_AHB3_GRP1_PERIPH_CRYP (*)
  *         @arg @ref LL_AHB3_GRP1_PERIPH_SAES (*)
  *         @arg @ref LL_AHB3_GRP1_PERIPH_PKA
  *
  *         (*) value not defined in all devices.
  * @retval uint32_t
  */
__STATIC_INLINE uint32_t LL_AHB3_GRP1_IsEnabledClock(uint32_t Periphs)
{
  return ((READ_BIT(RCC->AHB3ENR, Periphs) == Periphs) ? 1U : 0U);
}

/**
  * @brief  Disable AHB3 peripherals clock.
  * @rmtoll AHB3ENR      RNGEN         LL_AHB3_GRP1_DisableClock\n
  *         AHB3ENR      HASHEN        LL_AHB3_GRP1_DisableClock\n
  *         AHB3ENR      CRYPEN        LL_AHB3_GRP1_DisableClock\n
  *         AHB3ENR      SAESEN        LL_AHB3_GRP1_DisableClock\n
  *         AHB3ENR      PKAEN         LL_AHB3_GRP1_DisableClock
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_AHB3_GRP1_PERIPH_RNG
  *         @arg @ref LL_AHB3_GRP1_PERIPH_HASH
  *         @arg @ref LL_AHB3_GRP1_PERIPH_CRYP (*)
  *         @arg @ref LL_AHB3_GRP1_PERIPH_SAES (*)
  *         @arg @ref LL_AHB3_GRP1_PERIPH_PKA
  *
  *         (*) value not defined in all devices.
  * @retval None
  */
__STATIC_INLINE void LL_AHB3_GRP1_DisableClock(uint32_t Periphs)
{
  CLEAR_BIT(RCC->AHB3ENR, Periphs);
}

/**
  * @brief  Enable AHB3 peripherals clock.
  * @rmtoll AHB3RSTR     RNGRST        LL_AHB3_GRP1_ForceReset\n
  *         AHB3RSTR     HASHRST       LL_AHB3_GRP1_ForceReset\n
  *         AHB3RSTR     CRYPRST       LL_AHB3_GRP1_ForceReset\n
  *         AHB3RSTR     SAESRST       LL_AHB3_GRP1_ForceReset\n
  *         AHB3RSTR     PKARST        LL_AHB3_GRP1_ForceReset
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_AHB3_GRP1_PERIPH_RNG
  *         @arg @ref LL_AHB3_GRP1_PERIPH_HASH
  *         @arg @ref LL_AHB3_GRP1_PERIPH_CRYP (*)
  *         @arg @ref LL_AHB3_GRP1_PERIPH_SAES (*)
  *         @arg @ref LL_AHB3_GRP1_PERIPH_PKA
  *
  *         (*) value not defined in all devices.
  * @retval None
  */
__STATIC_INLINE void LL_AHB3_GRP1_ForceReset(uint32_t Periphs)
{
  SET_BIT(RCC->AHB3RSTR, Periphs);
}

/**
  * @brief  Release AHB3 peripherals reset.
  * @rmtoll AHB3RSTR     RNGRST        LL_AHB3_GRP1_ReleaseReset\n
  *         AHB3RSTR     HASHRST       LL_AHB3_GRP1_ReleaseReset\n
  *         AHB3RSTR     CRYPRST       LL_AHB3_GRP1_ReleaseReset\n
  *         AHB3RSTR     SAESRST       LL_AHB3_GRP1_ReleaseReset\n
  *         AHB3RSTR     PKARST        LL_AHB3_GRP1_ReleaseReset
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_AHB3_GRP1_PERIPH_RNG
  *         @arg @ref LL_AHB3_GRP1_PERIPH_HASH
  *         @arg @ref LL_AHB3_GRP1_PERIPH_CRYP (*)
  *         @arg @ref LL_AHB3_GRP1_PERIPH_SAES (*)
  *         @arg @ref LL_AHB3_GRP1_PERIPH_PKA
  *
  *         (*) value not defined in all devices.
  * @retval None
  */
__STATIC_INLINE void LL_AHB3_GRP1_ReleaseReset(uint32_t Periphs)
{
  CLEAR_BIT(RCC->AHB3RSTR, Periphs);
}

/**
  * @brief  Enable AHB3 peripherals clock during Low Power (Sleep) mode.
  * @rmtoll AHB3LPENR    RNGLPEN       LL_AHB3_GRP1_EnableClockSleep\n
  *         AHB3LPENR    HASHLPEN      LL_AHB3_GRP1_EnableClockSleep\n
  *         AHB3LPENR    CRYPLPEN      LL_AHB3_GRP1_EnableClockSleep\n
  *         AHB3LPENR    SAESLPEN      LL_AHB3_GRP1_EnableClockSleep\n
  *         AHB3LPENR    PKALPEN       LL_AHB3_GRP1_EnableClockSleep
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_AHB3_GRP1_PERIPH_RNG
  *         @arg @ref LL_AHB3_GRP1_PERIPH_HASH
  *         @arg @ref LL_AHB3_GRP1_PERIPH_CRYP (*)
  *         @arg @ref LL_AHB3_GRP1_PERIPH_SAES (*)
  *         @arg @ref LL_AHB3_GRP1_PERIPH_PKA
  *
  *         (*) value not defined in all devices.
  * @retval None
  */
__STATIC_INLINE void LL_AHB3_GRP1_EnableClockSleep(uint32_t Periphs)
{
  __IO uint32_t tmpreg;
  SET_BIT(RCC->AHB3LPENR, Periphs);
  /* Delay after an RCC peripheral clock enabling */
  tmpreg = READ_BIT(RCC->AHB3LPENR, Periphs);
  (void)tmpreg;
}

/**
  * @brief  Disable AHB3 peripherals clock during Low Power (Sleep) mode.
  * @rmtoll AHB3LPENR    RNGLPEN       LL_AHB3_GRP1_DisableClockSleep\n
  *         AHB3LPENR    HASHLPEN      LL_AHB3_GRP1_DisableClockSleep\n
  *         AHB3LPENR    CRYPLPEN      LL_AHB3_GRP1_DisableClockSleep\n
  *         AHB3LPENR    SAESLPEN      LL_AHB3_GRP1_DisableClockSleep\n
  *         AHB3LPENR    PKALPEN       LL_AHB3_GRP1_DisableClockSleep
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_AHB3_GRP1_PERIPH_RNG
  *         @arg @ref LL_AHB3_GRP1_PERIPH_HASH
  *         @arg @ref LL_AHB3_GRP1_PERIPH_CRYP (*)
  *         @arg @ref LL_AHB3_GRP1_PERIPH_SAES (*)
  *         @arg @ref LL_AHB3_GRP1_PERIPH_PKA
  *
  *         (*) value not defined in all devices.
  * @retval None
  */
__STATIC_INLINE void LL_AHB3_GRP1_DisableClockSleep(uint32_t Periphs)
{
  CLEAR_BIT(RCC->AHB3LPENR, Periphs);
}

/**
  * @}
  */

