RT-Thread/rt-thread/bsp/stm32/libraries/STM32H7RSxx_HAL/STM32H7RSxx_HAL_Driver/Inc/stm32h7rsxx_ll_bus.h
/** @defgroup BUS_LL_EF_AHB4 AHB4
  * @{
  */

/**
  * @brief  Enable AHB4 peripherals clock.
  * @rmtoll AHB4ENR      GPIOAEN       LL_AHB4_GRP1_EnableClock\n
  *         AHB4ENR      GPIOBEN       LL_AHB4_GRP1_EnableClock\n
  *         AHB4ENR      GPIOCEN       LL_AHB4_GRP1_EnableClock\n
  *         AHB4ENR      GPIODEN       LL_AHB4_GRP1_EnableClock\n
  *         AHB4ENR      GPIOEEN       LL_AHB4_GRP1_EnableClock\n
  *         AHB4ENR      GPIOFEN       LL_AHB4_GRP1_EnableClock\n
  *         AHB4ENR      GPIOGEN       LL_AHB4_GRP1_EnableClock\n
  *         AHB4ENR      GPIOHEN       LL_AHB4_GRP1_EnableClock\n
  *         AHB4ENR      GPIOMEN       LL_AHB4_GRP1_EnableClock\n
  *         AHB4ENR      GPIONEN       LL_AHB4_GRP1_EnableClock\n
  *         AHB4ENR      GPIOOEN       LL_AHB4_GRP1_EnableClock\n
  *         AHB4ENR      GPIOPEN       LL_AHB4_GRP1_EnableClock\n
  *         AHB4ENR      CRCEN         LL_AHB4_GRP1_EnableClock\n
  *         AHB4ENR      BKPRAMEN      LL_AHB4_GRP1_EnableClock
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_AHB4_GRP1_PERIPH_GPIOA
  *         @arg @ref LL_AHB4_GRP1_PERIPH_GPIOB
  *         @arg @ref LL_AHB4_GRP1_PERIPH_GPIOC
  *         @arg @ref LL_AHB4_GRP1_PERIPH_GPIOD
  *         @arg @ref LL_AHB4_GRP1_PERIPH_GPIOE
  *         @arg @ref LL_AHB4_GRP1_PERIPH_GPIOF
  *         @arg @ref LL_AHB4_GRP1_PERIPH_GPIOG
  *         @arg @ref LL_AHB4_GRP1_PERIPH_GPIOH
  *         @arg @ref LL_AHB4_GRP1_PERIPH_GPIOM
  *         @arg @ref LL_AHB4_GRP1_PERIPH_GPION
  *         @arg @ref LL_AHB4_GRP1_PERIPH_GPIOO
  *         @arg @ref LL_AHB4_GRP1_PERIPH_GPIOP
  *         @arg @ref LL_AHB4_GRP1_PERIPH_CRC
  *         @arg @ref LL_AHB4_GRP1_PERIPH_BKPRAM
  * @retval None
  */
__STATIC_INLINE void LL_AHB4_GRP1_EnableClock(uint32_t Periphs)
{
  __IO uint32_t tmpreg;
  SET_BIT(RCC->AHB4ENR, Periphs);
  /* Delay after an RCC peripheral clock enabling */
  tmpreg = READ_BIT(RCC->AHB4ENR, Periphs);
  (void)tmpreg;
}

/**
  * @brief  Check if AHB4 peripheral clock is enabled or not
  * @rmtoll AHB4ENR      GPIOAEN       LL_AHB4_GRP1_IsEnabledClock\n
  *         AHB4ENR      GPIOBEN       LL_AHB4_GRP1_IsEnabledClock\n
  *         AHB4ENR      GPIOCEN       LL_AHB4_GRP1_IsEnabledClock\n
  *         AHB4ENR      GPIODEN       LL_AHB4_GRP1_IsEnabledClock\n
  *         AHB4ENR      GPIOEEN       LL_AHB4_GRP1_IsEnabledClock\n
  *         AHB4ENR      GPIOFEN       LL_AHB4_GRP1_IsEnabledClock\n
  *         AHB4ENR      GPIOGEN       LL_AHB4_GRP1_IsEnabledClock\n
  *         AHB4ENR      GPIOHEN       LL_AHB4_GRP1_IsEnabledClock\n
  *         AHB4ENR      GPIOMEN       LL_AHB4_GRP1_IsEnabledClock\n
  *         AHB4ENR      GPIONEN       LL_AHB4_GRP1_IsEnabledClock\n
  *         AHB4ENR      GPIOOEN       LL_AHB4_GRP1_IsEnabledClock\n
  *         AHB4ENR      GPIOPEN       LL_AHB4_GRP1_IsEnabledClock\n
  *         AHB4ENR      CRCEN         LL_AHB4_GRP1_IsEnabledClock\n
  *         AHB4ENR      BKPRAMEN      LL_AHB4_GRP1_IsEnabledClock
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_AHB4_GRP1_PERIPH_GPIOA
  *         @arg @ref LL_AHB4_GRP1_PERIPH_GPIOB
  *         @arg @ref LL_AHB4_GRP1_PERIPH_GPIOC
  *         @arg @ref LL_AHB4_GRP1_PERIPH_GPIOD
  *         @arg @ref LL_AHB4_GRP1_PERIPH_GPIOE
  *         @arg @ref LL_AHB4_GRP1_PERIPH_GPIOF
  *         @arg @ref LL_AHB4_GRP1_PERIPH_GPIOG
  *         @arg @ref LL_AHB4_GRP1_PERIPH_GPIOH
  *         @arg @ref LL_AHB4_GRP1_PERIPH_GPIOM
  *         @arg @ref LL_AHB4_GRP1_PERIPH_GPION
  *         @arg @ref LL_AHB4_GRP1_PERIPH_GPIOO
  *         @arg @ref LL_AHB4_GRP1_PERIPH_GPIOP
  *         @arg @ref LL_AHB4_GRP1_PERIPH_CRC
  *         @arg @ref LL_AHB4_GRP1_PERIPH_BKPRAM
  * @retval uint32_t
  */
__STATIC_INLINE uint32_t LL_AHB4_GRP1_IsEnabledClock(uint32_t Periphs)
{
  return ((READ_BIT(RCC->AHB4ENR, Periphs) == Periphs) ? 1U : 0U);
}

/**
  * @brief  Disable AHB4 peripherals clock.
  * @rmtoll AHB4ENR      GPIOAEN       LL_AHB4_GRP1_DisableClock\n
  *         AHB4ENR      GPIOBEN       LL_AHB4_GRP1_DisableClock\n
  *         AHB4ENR      GPIOCEN       LL_AHB4_GRP1_DisableClock\n
  *         AHB4ENR      GPIODEN       LL_AHB4_GRP1_DisableClock\n
  *         AHB4ENR      GPIOEEN       LL_AHB4_GRP1_DisableClock\n
  *         AHB4ENR      GPIOFEN       LL_AHB4_GRP1_DisableClock\n
  *         AHB4ENR      GPIOGEN       LL_AHB4_GRP1_DisableClock\n
  *         AHB4ENR      GPIOHEN       LL_AHB4_GRP1_DisableClock\n
  *         AHB4ENR      GPIOMEN       LL_AHB4_GRP1_DisableClock\n
  *         AHB4ENR      GPIONEN       LL_AHB4_GRP1_DisableClock\n
  *         AHB4ENR      GPIOOEN       LL_AHB4_GRP1_DisableClock\n
  *         AHB4ENR      GPIOPEN       LL_AHB4_GRP1_DisableClock\n
  *         AHB4ENR      CRCEN         LL_AHB4_GRP1_DisableClock\n
  *         AHB4ENR      BKPRAMEN      LL_AHB4_GRP1_DisableClock
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_AHB4_GRP1_PERIPH_GPIOA
  *         @arg @ref LL_AHB4_GRP1_PERIPH_GPIOB
  *         @arg @ref LL_AHB4_GRP1_PERIPH_GPIOC
  *         @arg @ref LL_AHB4_GRP1_PERIPH_GPIOD
  *         @arg @ref LL_AHB4_GRP1_PERIPH_GPIOE
  *         @arg @ref LL_AHB4_GRP1_PERIPH_GPIOF
  *         @arg @ref LL_AHB4_GRP1_PERIPH_GPIOG
  *         @arg @ref LL_AHB4_GRP1_PERIPH_GPIOH
  *         @arg @ref LL_AHB4_GRP1_PERIPH_GPIOM
  *         @arg @ref LL_AHB4_GRP1_PERIPH_GPION
  *         @arg @ref LL_AHB4_GRP1_PERIPH_GPIOO
  *         @arg @ref LL_AHB4_GRP1_PERIPH_GPIOP
  *         @arg @ref LL_AHB4_GRP1_PERIPH_CRC
  *         @arg @ref LL_AHB4_GRP1_PERIPH_BKPRAM
  * @retval None
  */
__STATIC_INLINE void LL_AHB4_GRP1_DisableClock(uint32_t Periphs)
{
  CLEAR_BIT(RCC->AHB4ENR, Periphs);
}

/**
  * @brief  Force AHB4 peripherals reset.
  * @rmtoll AHB4RSTR     GPIOARST      LL_AHB4_GRP1_ForceReset\n
  *         AHB4RSTR     GPIOBRST      LL_AHB4_GRP1_ForceReset\n
  *         AHB4RSTR     GPIOCRST      LL_AHB4_GRP1_ForceReset\n
  *         AHB4RSTR     GPIODRST      LL_AHB4_GRP1_ForceReset\n
  *         AHB4RSTR     GPIOERST      LL_AHB4_GRP1_ForceReset\n
  *         AHB4RSTR     GPIOFRST      LL_AHB4_GRP1_ForceReset\n
  *         AHB4RSTR     GPIOGRST      LL_AHB4_GRP1_ForceReset\n
  *         AHB4RSTR     GPIOHRST      LL_AHB4_GRP1_ForceReset\n
  *         AHB4RSTR     GPIOMRST      LL_AHB4_GRP1_ForceReset\n
  *         AHB4RSTR     GPIONRST      LL_AHB4_GRP1_ForceReset\n
  *         AHB4RSTR     GPIOORST      LL_AHB4_GRP1_ForceReset\n
  *         AHB4RSTR     GPIOPRST      LL_AHB4_GRP1_ForceReset\n
  *         AHB4RSTR     CRCRST        LL_AHB4_GRP1_ForceReset\n
  *         AHB4RSTR     BKPRAMRST     LL_AHB4_GRP1_ForceReset
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_AHB4_GRP1_PERIPH_GPIOA
  *         @arg @ref LL_AHB4_GRP1_PERIPH_GPIOB
  *         @arg @ref LL_AHB4_GRP1_PERIPH_GPIOC
  *         @arg @ref LL_AHB4_GRP1_PERIPH_GPIOD
  *         @arg @ref LL_AHB4_GRP1_PERIPH_GPIOE
  *         @arg @ref LL_AHB4_GRP1_PERIPH_GPIOF
  *         @arg @ref LL_AHB4_GRP1_PERIPH_GPIOG
  *         @arg @ref LL_AHB4_GRP1_PERIPH_GPIOH
  *         @arg @ref LL_AHB4_GRP1_PERIPH_GPIOM
  *         @arg @ref LL_AHB4_GRP1_PERIPH_GPION
  *         @arg @ref LL_AHB4_GRP1_PERIPH_GPIOO
  *         @arg @ref LL_AHB4_GRP1_PERIPH_GPIOP
  *         @arg @ref LL_AHB4_GRP1_PERIPH_CRC
  *         @arg @ref LL_AHB4_GRP1_PERIPH_BKPRAM
  * @retval None
  */
__STATIC_INLINE void LL_AHB4_GRP1_ForceReset(uint32_t Periphs)
{
  SET_BIT(RCC->AHB4RSTR, Periphs);
}

/**
  * @brief  Release AHB4 peripherals reset.
  * @rmtoll AHB4RSTR     GPIOARST      LL_AHB4_GRP1_ReleaseReset\n
  *         AHB4RSTR     GPIOBRST      LL_AHB4_GRP1_ReleaseReset\n
  *         AHB4RSTR     GPIOCRST      LL_AHB4_GRP1_ReleaseReset\n
  *         AHB4RSTR     GPIODRST      LL_AHB4_GRP1_ReleaseReset\n
  *         AHB4RSTR     GPIOERST      LL_AHB4_GRP1_ReleaseReset\n
  *         AHB4RSTR     GPIOFRST      LL_AHB4_GRP1_ReleaseReset\n
  *         AHB4RSTR     GPIOGRST      LL_AHB4_GRP1_ReleaseReset\n
  *         AHB4RSTR     GPIOHRST      LL_AHB4_GRP1_ReleaseReset\n
  *         AHB4RSTR     GPIOMRST      LL_AHB4_GRP1_ReleaseReset\n
  *         AHB4RSTR     GPIONRST      LL_AHB4_GRP1_ReleaseReset\n
  *         AHB4RSTR     GPIOORST      LL_AHB4_GRP1_ReleaseReset\n
  *         AHB4RSTR     GPIOPRST      LL_AHB4_GRP1_ReleaseReset\n
  *         AHB4RSTR     CRCRST        LL_AHB4_GRP1_ReleaseReset
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_AHB4_GRP1_PERIPH_GPIOA
  *         @arg @ref LL_AHB4_GRP1_PERIPH_GPIOB
  *         @arg @ref LL_AHB4_GRP1_PERIPH_GPIOC
  *         @arg @ref LL_AHB4_GRP1_PERIPH_GPIOD
  *         @arg @ref LL_AHB4_GRP1_PERIPH_GPIOE
  *         @arg @ref LL_AHB4_GRP1_PERIPH_GPIOF
  *         @arg @ref LL_AHB4_GRP1_PERIPH_GPIOG
  *         @arg @ref LL_AHB4_GRP1_PERIPH_GPIOH
  *         @arg @ref LL_AHB4_GRP1_PERIPH_GPIOM
  *         @arg @ref LL_AHB4_GRP1_PERIPH_GPION
  *         @arg @ref LL_AHB4_GRP1_PERIPH_GPIOO
  *         @arg @ref LL_AHB4_GRP1_PERIPH_GPIOP
  *         @arg @ref LL_AHB4_GRP1_PERIPH_CRC
  * @retval None
  */
__STATIC_INLINE void LL_AHB4_GRP1_ReleaseReset(uint32_t Periphs)
{
  CLEAR_BIT(RCC->AHB4RSTR, Periphs);
}

/**
  * @brief  Enable AHB4 peripherals clock during Low Power (Sleep) mode.
  * @rmtoll AHB4LPENR    GPIOALPEN     LL_AHB4_GRP1_EnableClockSleep\n
  *         AHB4LPENR    GPIOBLPEN     LL_AHB4_GRP1_EnableClockSleep\n
  *         AHB4LPENR    GPIOCLPEN     LL_AHB4_GRP1_EnableClockSleep\n
  *         AHB4LPENR    GPIODLPEN     LL_AHB4_GRP1_EnableClockSleep\n
  *         AHB4LPENR    GPIOELPEN     LL_AHB4_GRP1_EnableClockSleep\n
  *         AHB4LPENR    GPIOFLPEN     LL_AHB4_GRP1_EnableClockSleep\n
  *         AHB4LPENR    GPIOGLPEN     LL_AHB4_GRP1_EnableClockSleep\n
  *         AHB4LPENR    GPIOHLPEN     LL_AHB4_GRP1_EnableClockSleep\n
  *         AHB4LPENR    GPIOMLPEN     LL_AHB4_GRP1_EnableClockSleep\n
  *         AHB4LPENR    GPIONLPEN     LL_AHB4_GRP1_EnableClockSleep\n
  *         AHB4LPENR    GPIOOLPEN     LL_AHB4_GRP1_EnableClockSleep\n
  *         AHB4LPENR    GPIOPLPEN     LL_AHB4_GRP1_EnableClockSleep\n
  *         AHB4LPENR    CRCLPEN       LL_AHB4_GRP1_EnableClockSleep\n
  *         AHB4LPENR    BKPRAMLPEN    LL_AHB4_GRP1_EnableClockSleep
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_AHB4_GRP1_PERIPH_GPIOA
  *         @arg @ref LL_AHB4_GRP1_PERIPH_GPIOB
  *         @arg @ref LL_AHB4_GRP1_PERIPH_GPIOC
  *         @arg @ref LL_AHB4_GRP1_PERIPH_GPIOD
  *         @arg @ref LL_AHB4_GRP1_PERIPH_GPIOE
  *         @arg @ref LL_AHB4_GRP1_PERIPH_GPIOF
  *         @arg @ref LL_AHB4_GRP1_PERIPH_GPIOG
  *         @arg @ref LL_AHB4_GRP1_PERIPH_GPIOH
  *         @arg @ref LL_AHB4_GRP1_PERIPH_GPIOM
  *         @arg @ref LL_AHB4_GRP1_PERIPH_GPION
  *         @arg @ref LL_AHB4_GRP1_PERIPH_GPIOO
  *         @arg @ref LL_AHB4_GRP1_PERIPH_GPIOP
  *         @arg @ref LL_AHB4_GRP1_PERIPH_CRC
  *         @arg @ref LL_AHB4_GRP1_PERIPH_BKPRAM
  * @retval None
  */
__STATIC_INLINE void LL_AHB4_GRP1_EnableClockSleep(uint32_t Periphs)
{
  __IO uint32_t tmpreg;
  SET_BIT(RCC->AHB4LPENR, Periphs);
  /* Delay after an RCC peripheral clock enabling */
  tmpreg = READ_BIT(RCC->AHB4LPENR, Periphs);
  (void)tmpreg;
}

/**
  * @brief  Disable AHB4 peripherals clock during Low Power (Sleep) mode.
  * @rmtoll AHB4LPENR    GPIOALPEN     LL_AHB4_GRP1_DisableClockSleep\n
  *         AHB4LPENR    GPIOBLPEN     LL_AHB4_GRP1_DisableClockSleep\n
  *         AHB4LPENR    GPIOCLPEN     LL_AHB4_GRP1_DisableClockSleep\n
  *         AHB4LPENR    GPIODLPEN     LL_AHB4_GRP1_DisableClockSleep\n
  *         AHB4LPENR    GPIOELPEN     LL_AHB4_GRP1_DisableClockSleep\n
  *         AHB4LPENR    GPIOFLPEN     LL_AHB4_GRP1_DisableClockSleep\n
  *         AHB4LPENR    GPIOGLPEN     LL_AHB4_GRP1_DisableClockSleep\n
  *         AHB4LPENR    GPIOHLPEN     LL_AHB4_GRP1_DisableClockSleep\n
  *         AHB4LPENR    GPIOMLPEN     LL_AHB4_GRP1_DisableClockSleep\n
  *         AHB4LPENR    GPIONLPEN     LL_AHB4_GRP1_DisableClockSleep\n
  *         AHB4LPENR    GPIOOLPEN     LL_AHB4_GRP1_DisableClockSleep\n
  *         AHB4LPENR    GPIOPLPEN     LL_AHB4_GRP1_DisableClockSleep\n
  *         AHB4LPENR    CRCLPEN       LL_AHB4_GRP1_DisableClockSleep\n
  *         AHB4LPENR    BKPRAMLPEN    LL_AHB4_GRP1_DisableClockSleep
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_AHB4_GRP1_PERIPH_GPIOA
  *         @arg @ref LL_AHB4_GRP1_PERIPH_GPIOB
  *         @arg @ref LL_AHB4_GRP1_PERIPH_GPIOC
  *         @arg @ref LL_AHB4_GRP1_PERIPH_GPIOD
  *         @arg @ref LL_AHB4_GRP1_PERIPH_GPIOE
  *         @arg @ref LL_AHB4_GRP1_PERIPH_GPIOF
  *         @arg @ref LL_AHB4_GRP1_PERIPH_GPIOG
  *         @arg @ref LL_AHB4_GRP1_PERIPH_GPIOH
  *         @arg @ref LL_AHB4_GRP1_PERIPH_GPIOM
  *         @arg @ref LL_AHB4_GRP1_PERIPH_GPION
  *         @arg @ref LL_AHB4_GRP1_PERIPH_GPIOO
  *         @arg @ref LL_AHB4_GRP1_PERIPH_GPIOP
  *         @arg @ref LL_AHB4_GRP1_PERIPH_CRC
  *         @arg @ref LL_AHB4_GRP1_PERIPH_BKPRAM
  * @retval None
  */
__STATIC_INLINE void LL_AHB4_GRP1_DisableClockSleep(uint32_t Periphs)
{
  CLEAR_BIT(RCC->AHB4LPENR, Periphs);
}

/**
  * @}
  */

/** @defgroup BUS_LL_EF_AHB5 AHB5
  * @{
  */

/**
  * @brief  Enable AHB5 peripherals clock.
  * @rmtoll AHB5ENR      HPDMA1EN      LL_AHB5_GRP1_EnableClock\n
  *         AHB5ENR      DMA2DEN       LL_AHB5_GRP1_EnableClock\n
  *         AHB5ENR      JPEGEN        LL_AHB5_GRP1_EnableClock\n
  *         AHB5ENR      FMCEN         LL_AHB5_GRP1_EnableClock\n
  *         AHB5ENR      XSPI1EN       LL_AHB5_GRP1_EnableClock\n
  *         AHB5ENR      XSPI2EN       LL_AHB5_GRP1_EnableClock\n
  *         AHB5ENR      XSPIMEN       LL_AHB5_GRP1_EnableClock\n
  *         AHB5ENR      SDMMC1EN      LL_AHB5_GRP1_EnableClock\n
  *         AHB5ENR      GFXMMUEN      LL_AHB5_GRP1_EnableClock\n
  *         AHB5ENR      GPU2DEN       LL_AHB5_GRP1_EnableClock
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_AHB5_GRP1_PERIPH_HPDMA1
  *         @arg @ref LL_AHB5_GRP1_PERIPH_DMA2D
  *         @arg @ref LL_AHB5_GRP1_PERIPH_JPEG (*)
  *         @arg @ref LL_AHB5_GRP1_PERIPH_FMC
  *         @arg @ref LL_AHB5_GRP1_PERIPH_XSPI1
  *         @arg @ref LL_AHB5_GRP1_PERIPH_XSPI2
  *         @arg @ref LL_AHB5_GRP1_PERIPH_XSPIM
  *         @arg @ref LL_AHB5_GRP1_PERIPH_SDMMC1
  *         @arg @ref LL_AHB5_GRP1_PERIPH_GFXMMU (*)
  *         @arg @ref LL_AHB5_GRP1_PERIPH_GPU2D (*)
  *
  *         (*) value not defined in all devices.
  * @retval None
  */
__STATIC_INLINE void LL_AHB5_GRP1_EnableClock(uint32_t Periphs)
{
  __IO uint32_t tmpreg;
  SET_BIT(RCC->AHB5ENR, Periphs);
  /* Delay after an RCC peripheral clock enabling */
  tmpreg = READ_BIT(RCC->AHB5ENR, Periphs);
  (void)tmpreg;
}

/**
  * @brief  Check if AHB5 peripheral clock is enabled or not
  * @rmtoll AHB5ENR      HPDMA1EN      LL_AHB5_GRP1_IsEnabledClock\n
  *         AHB5ENR      DMA2DEN       LL_AHB5_GRP1_IsEnabledClock\n
  *         AHB5ENR      JPEGEN        LL_AHB5_GRP1_IsEnabledClock\n
  *         AHB5ENR      FMCEN         LL_AHB5_GRP1_IsEnabledClock\n
  *         AHB5ENR      XSPI1EN       LL_AHB5_GRP1_IsEnabledClock\n
  *         AHB5ENR      XSPI2EN       LL_AHB5_GRP1_IsEnabledClock\n
  *         AHB5ENR      XSPIMEN       LL_AHB5_GRP1_IsEnabledClock\n
  *         AHB5ENR      SDMMC1EN      LL_AHB5_GRP1_IsEnabledClock\n
  *         AHB5ENR      GFXMMUEN      LL_AHB5_GRP1_IsEnabledClock\n
  *         AHB5ENR      GPU2DEN       LL_AHB5_GRP1_IsEnabledClock
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_AHB5_GRP1_PERIPH_HPDMA1
  *         @arg @ref LL_AHB5_GRP1_PERIPH_DMA2D
  *         @arg @ref LL_AHB5_GRP1_PERIPH_JPEG (*)
  *         @arg @ref LL_AHB5_GRP1_PERIPH_FMC
  *         @arg @ref LL_AHB5_GRP1_PERIPH_XSPI1
  *         @arg @ref LL_AHB5_GRP1_PERIPH_XSPI2
  *         @arg @ref LL_AHB5_GRP1_PERIPH_XSPIM
  *         @arg @ref LL_AHB5_GRP1_PERIPH_SDMMC1
  *         @arg @ref LL_AHB5_GRP1_PERIPH_GFXMMU (*)
  *         @arg @ref LL_AHB5_GRP1_PERIPH_GPU2D (*)
  *
  *         (*) value not defined in all devices.
  * @retval uint32_t
  */
__STATIC_INLINE uint32_t LL_AHB5_GRP1_IsEnabledClock(uint32_t Periphs)
{
  return ((READ_BIT(RCC->AHB5ENR, Periphs) == Periphs) ? 1U : 0U);
}

/**
  * @brief  Disable AHB5 peripherals clock.
  * @rmtoll AHB5ENR      HPDMA1EN      LL_AHB5_GRP1_DisableClock\n
  *         AHB5ENR      DMA2DEN       LL_AHB5_GRP1_DisableClock\n
  *         AHB5ENR      JPEGEN        LL_AHB5_GRP1_DisableClock\n
  *         AHB5ENR      FMCEN         LL_AHB5_GRP1_DisableClock\n
  *         AHB5ENR      XSPI1EN       LL_AHB5_GRP1_DisableClock\n
  *         AHB5ENR      XSPI2EN       LL_AHB5_GRP1_DisableClock\n
  *         AHB5ENR      XSPIMEN       LL_AHB5_GRP1_DisableClock\n
  *         AHB5ENR      SDMMC1EN      LL_AHB5_GRP1_DisableClock\n
  *         AHB5ENR      GFXMMUEN      LL_AHB5_GRP1_DisableClock\n
  *         AHB5ENR      GPU2DEN       LL_AHB5_GRP1_DisableClock
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_AHB5_GRP1_PERIPH_HPDMA1
  *         @arg @ref LL_AHB5_GRP1_PERIPH_DMA2D
  *         @arg @ref LL_AHB5_GRP1_PERIPH_JPEG (*)
  *         @arg @ref LL_AHB5_GRP1_PERIPH_FMC
  *         @arg @ref LL_AHB5_GRP1_PERIPH_XSPI1
  *         @arg @ref LL_AHB5_GRP1_PERIPH_XSPI2
  *         @arg @ref LL_AHB5_GRP1_PERIPH_XSPIM
  *         @arg @ref LL_AHB5_GRP1_PERIPH_SDMMC1
  *         @arg @ref LL_AHB5_GRP1_PERIPH_GFXMMU (*)
  *         @arg @ref LL_AHB5_GRP1_PERIPH_GPU2D (*)
  *
  *         (*) value not defined in all devices.
  * @retval None
  */
__STATIC_INLINE void LL_AHB5_GRP1_DisableClock(uint32_t Periphs)
{
  CLEAR_BIT(RCC->AHB5ENR, Periphs);
}

/**
  * @brief  Force AHB5 peripherals reset.
  * @rmtoll AHB5RSTR     HPDMA1RST     LL_AHB5_GRP1_ForceReset\n
  *         AHB5RSTR     DMA2DRST      LL_AHB5_GRP1_ForceReset\n
  *         AHB5RSTR     JPEGRST       LL_AHB5_GRP1_ForceReset\n
  *         AHB5RSTR     FMCRST        LL_AHB5_GRP1_ForceReset\n
  *         AHB5RSTR     XSPI1RST      LL_AHB5_GRP1_ForceReset\n
  *         AHB5RSTR     XSPI2RST      LL_AHB5_GRP1_ForceReset\n
  *         AHB5RSTR     XSPIMRST      LL_AHB5_GRP1_ForceReset\n
  *         AHB5RSTR     SDMMC1RST     LL_AHB5_GRP1_ForceReset\n
  *         AHB5RSTR     GFXMMURST     LL_AHB5_GRP1_ForceReset\n
  *         AHB5RSTR     GPU2DRST      LL_AHB5_GRP1_ForceReset
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_AHB5_GRP1_PERIPH_HPDMA1
  *         @arg @ref LL_AHB5_GRP1_PERIPH_DMA2D
  *         @arg @ref LL_AHB5_GRP1_PERIPH_JPEG (*)
  *         @arg @ref LL_AHB5_GRP1_PERIPH_FMC
  *         @arg @ref LL_AHB5_GRP1_PERIPH_XSPI1
  *         @arg @ref LL_AHB5_GRP1_PERIPH_XSPI2
  *         @arg @ref LL_AHB5_GRP1_PERIPH_XSPIM
  *         @arg @ref LL_AHB5_GRP1_PERIPH_SDMMC1
  *         @arg @ref LL_AHB5_GRP1_PERIPH_GFXMMU (*)
  *         @arg @ref LL_AHB5_GRP1_PERIPH_GPU2D (*)
  *
  *         (*) value not defined in all devices.
  * @retval None
  */
__STATIC_INLINE void LL_AHB5_GRP1_ForceReset(uint32_t Periphs)
{
  SET_BIT(RCC->AHB5RSTR, Periphs);
}

/**
  * @brief  Release AHB5 peripherals reset.
  * @rmtoll AHB5RSTR     HPDMA1RST     LL_AHB5_GRP1_ReleaseReset\n
  *         AHB5RSTR     DMA2DRST      LL_AHB5_GRP1_ReleaseReset\n
  *         AHB5RSTR     JPEGRST       LL_AHB5_GRP1_ReleaseReset\n
  *         AHB5RSTR     FMCRST        LL_AHB5_GRP1_ReleaseReset\n
  *         AHB5RSTR     XSPI1RST      LL_AHB5_GRP1_ReleaseReset\n
  *         AHB5RSTR     XSPI2RST      LL_AHB5_GRP1_ReleaseReset\n
  *         AHB5RSTR     XSPIMRST      LL_AHB5_GRP1_ReleaseReset\n
  *         AHB5RSTR     SDMMC1RST     LL_AHB5_GRP1_ReleaseReset\n
  *         AHB5RSTR     GFXMMURST     LL_AHB5_GRP1_ReleaseReset\n
  *         AHB5RSTR     GPU2DRST      LL_AHB5_GRP1_ReleaseReset
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_AHB5_GRP1_PERIPH_HPDMA1
  *         @arg @ref LL_AHB5_GRP1_PERIPH_DMA2D
  *         @arg @ref LL_AHB5_GRP1_PERIPH_JPEG (*)
  *         @arg @ref LL_AHB5_GRP1_PERIPH_FMC
  *         @arg @ref LL_AHB5_GRP1_PERIPH_XSPI1
  *         @arg @ref LL_AHB5_GRP1_PERIPH_XSPI2
  *         @arg @ref LL_AHB5_GRP1_PERIPH_XSPIM
  *         @arg @ref LL_AHB5_GRP1_PERIPH_SDMMC1
  *         @arg @ref LL_AHB5_GRP1_PERIPH_GFXMMU (*)
  *         @arg @ref LL_AHB5_GRP1_PERIPH_GPU2D (*)
  *
  *         (*) value not defined in all devices.
  * @retval None
  */
__STATIC_INLINE void LL_AHB5_GRP1_ReleaseReset(uint32_t Periphs)
{
  CLEAR_BIT(RCC->AHB5RSTR, Periphs);
}

/**
  * @brief  Enable AHB5 peripherals clock during Low Power (Sleep) mode.
  * @rmtoll AHB5LPENR    HPDMA1LPEN    LL_AHB5_GRP1_EnableClockSleep\n
  *         AHB5LPENR    DMA2DLPEN     LL_AHB5_GRP1_EnableClockSleep\n
  *         AHB5LPENR    JPEGLPEN      LL_AHB5_GRP1_EnableClockSleep\n
  *         AHB5LPENR    FMCLPEN       LL_AHB5_GRP1_EnableClockSleep\n
  *         AHB5LPENR    XSPI1LPEN     LL_AHB5_GRP1_EnableClockSleep\n
  *         AHB5LPENR    XSPI2LPEN     LL_AHB5_GRP1_EnableClockSleep\n
  *         AHB5LPENR    XSPIMLPEN     LL_AHB5_GRP1_EnableClockSleep\n
  *         AHB5LPENR    SDMMC1LPEN    LL_AHB5_GRP1_EnableClockSleep\n
  *         AHB5LPENR    GFXMMULPEN    LL_AHB5_GRP1_EnableClockSleep\n
  *         AHB5LPENR    GPU2DLPEN     LL_AHB5_GRP1_EnableClockSleep\n
  *         AHB5LPENR    AXISRAMPLEN   LL_AHB5_GRP1_EnableClockSleep\n
  *         AHB5LPENR    DTCM1PLEN     LL_AHB5_GRP1_EnableClockSleep\n
  *         AHB5LPENR    DTCM2PLEN     LL_AHB5_GRP1_EnableClockSleep\n
  *         AHB5LPENR    ITCMPLEN      LL_AHB5_GRP1_EnableClockSleep
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_AHB5_GRP1_PERIPH_HPDMA1
  *         @arg @ref LL_AHB5_GRP1_PERIPH_DMA2D
  *         @arg @ref LL_AHB5_GRP1_PERIPH_FLASH
  *         @arg @ref LL_AHB5_GRP1_PERIPH_JPEG (*)
  *         @arg @ref LL_AHB5_GRP1_PERIPH_FMC
  *         @arg @ref LL_AHB5_GRP1_PERIPH_XSPI1
  *         @arg @ref LL_AHB5_GRP1_PERIPH_XSPI2
  *         @arg @ref LL_AHB5_GRP1_PERIPH_XSPIM
  *         @arg @ref LL_AHB5_GRP1_PERIPH_SDMMC1
  *         @arg @ref LL_AHB5_GRP1_PERIPH_GFXMMU (*)
  *         @arg @ref LL_AHB5_GRP1_PERIPH_GPU2D (*)
  *         @arg @ref LL_AHB5_GRP1_PERIPH_AXISRAM
  *         @arg @ref LL_AHB5_GRP1_PERIPH_DTCM1
  *         @arg @ref LL_AHB5_GRP1_PERIPH_DTCM2
  *         @arg @ref LL_AHB5_GRP1_PERIPH_ITCM
  *
  *         (*) value not defined in all devices.
  * @retval None
  */
__STATIC_INLINE void LL_AHB5_GRP1_EnableClockSleep(uint32_t Periphs)
{
  __IO uint32_t tmpreg;
  SET_BIT(RCC->AHB5LPENR, Periphs);
  /* Delay after an RCC peripheral clock enabling */
  tmpreg = READ_BIT(RCC->AHB5LPENR, Periphs);
  (void)tmpreg;
}

