RT-Thread/rt-thread/bsp/stm32/libraries/STM32H7RSxx_HAL/STM32H7RSxx_HAL_Driver/Inc/stm32h7rsxx_ll_bus.h
/** @defgroup BUS_LL_EF_CKGA CKGA (AXI Clocks Gating)
  * @{
  */

/**
  * @brief  Enable clock gating for AXI bus peripherals.
  * @rmtoll CKGDISR      AXICKG      LL_CKGA_Enable\n
  *         CKGDISR      AHBMCKG     LL_CKGA_Enable\n
  *         CKGDISR      SDMMC1CKG   LL_CKGA_Enable\n
  *         CKGDISR      HPDMA1CKG   LL_CKGA_Enable\n
  *         CKGDISR      CPUCKG      LL_CKGA_Enable\n
  *         CKGDISR      GPU2DS0CKG  LL_CKGA_Enable\n
  *         CKGDISR      GPU2DS1CKG  LL_CKGA_Enable\n
  *         CKGDISR      GPUCLCKG    LL_CKGA_Enable\n
  *         CKGDISR      DCMIPPCKG   LL_CKGA_Enable\n
  *         CKGDISR      DMA2DCKG    LL_CKGA_Enable\n
  *         CKGDISR      GFXMMUSCKG  LL_CKGA_Enable\n
  *         CKGDISR      LTDCCKG     LL_CKGA_Enable\n
  *         CKGDISR      GFXMMUMCKG  LL_CKGA_Enable\n
  *         CKGDISR      AHBSCKG     LL_CKGA_Enable\n
  *         CKGDISR      FMCCKG      LL_CKGA_Enable\n
  *         CKGDISR      XSPI2CKG    LL_CKGA_Enable\n
  *         CKGDISR      XSPI1CKG    LL_CKGA_Enable\n
  *         CKGDISR      AXIRAM1CKG  LL_CKGA_Enable\n
  *         CKGDISR      AXIRAM2CKG  LL_CKGA_Enable\n
  *         CKGDISR      AXIRAM3CKG  LL_CKGA_Enable\n
  *         CKGDISR      AXIRAM4CKG  LL_CKGA_Enable\n
  *         CKGDISR      FLASHCKG    LL_CKGA_Enable\n
  *         CKGDISR      EXTICKG     LL_CKGA_Enable\n
  *         CKGDISR      JTAGCKG     LL_CKGA_Enable
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_CKGA_PERIPH_AXI
  *         @arg @ref LL_CKGA_PERIPH_AHBM
  *         @arg @ref LL_CKGA_PERIPH_AHBS
  *         @arg @ref LL_CKGA_PERIPH_SDMMC1
  *         @arg @ref LL_CKGA_PERIPH_HPDMA1
  *         @arg @ref LL_CKGA_PERIPH_CPU
  *         @arg @ref LL_CKGA_PERIPH_GPU2DS0 (*)
  *         @arg @ref LL_CKGA_PERIPH_GPU2DS1 (*)
  *         @arg @ref LL_CKGA_PERIPH_GPU2DCL (*)
  *         @arg @ref LL_CKGA_PERIPH_DMA2D
  *         @arg @ref LL_CKGA_PERIPH_DCMIPP
  *         @arg @ref LL_CKGA_PERIPH_LTDC (*)
  *         @arg @ref LL_CKGA_PERIPH_FLASH
  *         @arg @ref LL_CKGA_PERIPH_XSPI2
  *         @arg @ref LL_CKGA_PERIPH_XSPI1
  *         @arg @ref LL_CKGA_PERIPH_FMC
  *         @arg @ref LL_CKGA_PERIPH_AXIRAM1
  *         @arg @ref LL_CKGA_PERIPH_AXIRAM2
  *         @arg @ref LL_CKGA_PERIPH_AXIRAM3
  *         @arg @ref LL_CKGA_PERIPH_AXIRAM4
  *         @arg @ref LL_CKGA_PERIPH_GFXMMUM
  *         @arg @ref LL_CKGA_PERIPH_GFXMMUS
  *         @arg @ref LL_CKGA_PERIPH_EXTI
  *         @arg @ref LL_CKGA_PERIPH_JTAG
  *
  *         (*) value not defined in all devices.
  * @retval None
  */
__STATIC_INLINE void LL_CKGA_Enable(uint32_t Periphs)
{
  CLEAR_BIT(RCC->CKGDISR, Periphs);
}

/**
  * @brief  Check if AXI bus peripherals clock gating is enabled or not
  * @rmtoll CKGDISR      AXICKG      LL_CKGA_IsEnabledClock\n
  *         CKGDISR      AHBMCKG     LL_CKGA_IsEnabledClock\n
  *         CKGDISR      SDMMC1CKG   LL_CKGA_IsEnabledClock\n
  *         CKGDISR      HPDMA1CKG   LL_CKGA_IsEnabledClock\n
  *         CKGDISR      CPUCKG      LL_CKGA_IsEnabledClock\n
  *         CKGDISR      GPU2DS0CKG  LL_CKGA_IsEnabledClock\n
  *         CKGDISR      GPU2DS1CKG  LL_CKGA_IsEnabledClock\n
  *         CKGDISR      GPU2DCLCKG  LL_CKGA_IsEnabledClock\n
  *         CKGDISR      DCMIPPCKG   LL_CKGA_IsEnabledClock\n
  *         CKGDISR      DMA2DCKG    LL_CKGA_IsEnabledClock\n
  *         CKGDISR      GFXMMUSCKG  LL_CKGA_IsEnabledClock\n
  *         CKGDISR      LTDCCKG     LL_CKGA_IsEnabledClock\n
  *         CKGDISR      GFXMMUMCKG  LL_CKGA_IsEnabledClock\n
  *         CKGDISR      AHBSCKG     LL_CKGA_IsEnabledClock\n
  *         CKGDISR      FMCCKG      LL_CKGA_IsEnabledClock\n
  *         CKGDISR      XSPI2CKG    LL_CKGA_IsEnabledClock\n
  *         CKGDISR      XSPI1CKG    LL_CKGA_IsEnabledClock\n
  *         CKGDISR      AXIRAM1CKG  LL_CKGA_IsEnabledClock\n
  *         CKGDISR      AXIRAM2CKG  LL_CKGA_IsEnabledClock\n
  *         CKGDISR      AXIRAM3CKG  LL_CKGA_IsEnabledClock\n
  *         CKGDISR      AXIRAM4CKG  LL_CKGA_IsEnabledClock\n
  *         CKGDISR      FLASHCKG    LL_CKGA_IsEnabledClock\n
  *         CKGDISR      EXTICKG     LL_CKGA_IsEnabledClock\n
  *         CKGDISR      JTAGCKG     LL_CKGA_IsEnabledClock
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_CKGA_PERIPH_AXI
  *         @arg @ref LL_CKGA_PERIPH_AHBM
  *         @arg @ref LL_CKGA_PERIPH_AHBS
  *         @arg @ref LL_CKGA_PERIPH_SDMMC1
  *         @arg @ref LL_CKGA_PERIPH_HPDMA1
  *         @arg @ref LL_CKGA_PERIPH_CPU
  *         @arg @ref LL_CKGA_PERIPH_GPU2DS0 (*)
  *         @arg @ref LL_CKGA_PERIPH_GPU2DS1 (*)
  *         @arg @ref LL_CKGA_PERIPH_GPU2DCL (*)
  *         @arg @ref LL_CKGA_PERIPH_DMA2D
  *         @arg @ref LL_CKGA_PERIPH_DCMIPP
  *         @arg @ref LL_CKGA_PERIPH_LTDC (*)
  *         @arg @ref LL_CKGA_PERIPH_FLASH
  *         @arg @ref LL_CKGA_PERIPH_XSPI2
  *         @arg @ref LL_CKGA_PERIPH_XSPI1
  *         @arg @ref LL_CKGA_PERIPH_FMC
  *         @arg @ref LL_CKGA_PERIPH_AXIRAM1
  *         @arg @ref LL_CKGA_PERIPH_AXIRAM2
  *         @arg @ref LL_CKGA_PERIPH_AXIRAM3
  *         @arg @ref LL_CKGA_PERIPH_AXIRAM4
  *         @arg @ref LL_CKGA_PERIPH_GFXMMUM
  *         @arg @ref LL_CKGA_PERIPH_GFXMMUS
  *         @arg @ref LL_CKGA_PERIPH_EXTI
  *         @arg @ref LL_CKGA_PERIPH_JTAG
  *
  *         (*) value not defined in all devices.
  * @retval uint32_t
  */
__STATIC_INLINE uint32_t LL_CKGA_IsEnabledClock(uint32_t Periphs)
{
  return ((READ_BIT(RCC->CKGDISR, Periphs) == 0U) ? 1U : 0U);
}

/**
  * @brief  Disable clock gating for AXI bus peripherals.
  * @rmtoll CKGDISR      AXICKG      LL_CKGA_Disable\n
  *         CKGDISR      AHBMCKG     LL_CKGA_Disable\n
  *         CKGDISR      SDMMC1CKG   LL_CKGA_Disable\n
  *         CKGDISR      HPDMA1CKG   LL_CKGA_Disable\n
  *         CKGDISR      CPUCKG      LL_CKGA_Disable\n
  *         CKGDISR      GPU2DS0CKG  LL_CKGA_Disable\n
  *         CKGDISR      GPU2DS1CKG  LL_CKGA_Disable\n
  *         CKGDISR      GPUCLCKG    LL_CKGA_Disable\n
  *         CKGDISR      DCMIPPCKG   LL_CKGA_Disable\n
  *         CKGDISR      DMA2DCKG    LL_CKGA_Disable\n
  *         CKGDISR      GFXMMUSCKG  LL_CKGA_Disable\n
  *         CKGDISR      LTDCCKG     LL_CKGA_Disable\n
  *         CKGDISR      GFXMMUMCKG  LL_CKGA_Disable\n
  *         CKGDISR      AHBSCKG     LL_CKGA_Disable\n
  *         CKGDISR      FMCCKG      LL_CKGA_Disable\n
  *         CKGDISR      XSPI2CKG    LL_CKGA_Disable\n
  *         CKGDISR      XSPI1CKG    LL_CKGA_Disable\n
  *         CKGDISR      AXIRAM1CKG  LL_CKGA_Disable\n
  *         CKGDISR      AXIRAM2CKG  LL_CKGA_Disable\n
  *         CKGDISR      AXIRAM3CKG  LL_CKGA_Disable\n
  *         CKGDISR      AXIRAM4CKG  LL_CKGA_Disable\n
  *         CKGDISR      FLASHCKG    LL_CKGA_Disable\n
  *         CKGDISR      EXTICKG     LL_CKGA_Disable\n
  *         CKGDISR      JTAGCKG     LL_CKGA_Disable
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_CKGA_PERIPH_AXI
  *         @arg @ref LL_CKGA_PERIPH_AHBM
  *         @arg @ref LL_CKGA_PERIPH_AHBS
  *         @arg @ref LL_CKGA_PERIPH_SDMMC1
  *         @arg @ref LL_CKGA_PERIPH_HPDMA1
  *         @arg @ref LL_CKGA_PERIPH_CPU
  *         @arg @ref LL_CKGA_PERIPH_GPU2DS0
  *         @arg @ref LL_CKGA_PERIPH_GPU2DS1
  *         @arg @ref LL_CKGA_PERIPH_GPU2DCL
  *         @arg @ref LL_CKGA_PERIPH_DMA2D
  *         @arg @ref LL_CKGA_PERIPH_DCMIPP
  *         @arg @ref LL_CKGA_PERIPH_LTDC
  *         @arg @ref LL_CKGA_PERIPH_FLASH
  *         @arg @ref LL_CKGA_PERIPH_XSPI2
  *         @arg @ref LL_CKGA_PERIPH_XSPI1
  *         @arg @ref LL_CKGA_PERIPH_FMC
  *         @arg @ref LL_CKGA_PERIPH_AXIRAM1
  *         @arg @ref LL_CKGA_PERIPH_AXIRAM2
  *         @arg @ref LL_CKGA_PERIPH_AXIRAM3
  *         @arg @ref LL_CKGA_PERIPH_AXIRAM4
  *         @arg @ref LL_CKGA_PERIPH_GFXMMUM
  *         @arg @ref LL_CKGA_PERIPH_GFXMMUS
  *         @arg @ref LL_CKGA_PERIPH_EXTI
  *         @arg @ref LL_CKGA_PERIPH_JTAG
  *
  *         (*) value not defined in all devices.
  * @retval None
  */
__STATIC_INLINE void LL_CKGA_Disable(uint32_t Periphs)
{
  SET_BIT(RCC->CKGDISR, Periphs);
}
/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

#endif /* defined(RCC) */

/**
  * @}
  */

#ifdef __cplusplus
}
#endif

#endif /* STM32H7RSxx_LL_BUS_H */
